12/data/attachments/6eed2b26885a68c8.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:sendInvitationRequest>
            <nif:username>Amy_international_Friend_20862_1</nif:username>
            <nif:friendToBeRequested>soap_friends_2285751f-b641-4364-b570-3a4ef0958e6f</nif:friendToBeRequested>
        </nif:sendInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>